tap "dart-lang/dart"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "leoafarias/fvm"
tap "oven-sh/bun"
# Run your GitHub Actions locally
brew "act"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Automatic configure script builder
brew "autoconf"
# Collection of over 500 reusable autoconf macros
brew "autoconf-archive"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Binary installation for rust projects
brew "cargo-binstall"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Post-modern modal text editor
brew "helix"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Next-gen compiler infrastructure
brew "llvm"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Open source relational database management system
brew "mysql"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Small build system for use with gyp or CMake
brew "ninja"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@16"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-platform application and UI framework
brew "qt"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Create beautiful image of your source code
brew "silicon"
# Cross-shell prompt for astronauts
brew "starship"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Terraform
brew "hashicorp/tap/terraform"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# GPU-accelerated terminal emulator
cask "alacritty"
# Tools for building Android applications
cask "android-studio"
# Chromium based browser
cask "arc"
# Video calls designed for energy, ideas and action
cask "around"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Text editor
cask "emacs"
# Web browser
cask "firefox"
cask "font-cica"
cask "font-fira-code-nerd-font"
cask "font-monaspace"
cask "font-udev-gothic-nf"
cask "font-victor-mono-nerd-font"
# Virtual video-calling space
cask "gather"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Japanese input software
cask "google-japanese-ime"
# Tools to protect your emails and files
cask "gpg-suite"
# Screenshot and screen recording tool
cask "gyazo"
# Customize keymap, shortcuts, and gesture pad behavior on HHKB Studio
cask "hhkb-studio"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# App to manage software development and track bugs
cask "linear-linear"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Neovim Client
cask "neovide"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# IDE for professional Python development
cask "pycharm"
# Control your tools with a few keystrokes
cask "raycast"
# Rust IDE
cask "rustrover"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Mesh VPN based on WireGuard
cask "tailscale"
# To-do & task list manager
cask "ticktick"
# Open-source code editor
cask "visual-studio-code"
# JavaScript IDE
cask "webstorm"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network protocol analyzer
cask "wireshark"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen-browser"
# Video communication and virtual meeting platform
cask "zoom"
# Desktop client for the Zulip team chat platform
cask "zulip"
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Logic Pro", id: 634148309
mas "Numbers", id: 409203825
mas "Omnivore", id: 1564031042
mas "Pages", id: 409201541
mas "Reeder", id: 1529448980
mas "Reeder", id: 6475002485
mas "RunCat", id: 1429033973
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835
